### Datafrme by using the dictionary.

In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import DataFrame,Series

In [3]:
dict = {'City':['Delhi','Pune','Mumbai','Nagpur'],'Population':['7000','100000','200000','5000'],'Company':['info','TCS','Mahindra','hi']}

In [4]:
data=pd.DataFrame(dict,index=[100,101,102,103])

In [5]:
data.head()

       City Population   Company
100   Delhi       7000      info
101    Pune     100000       TCS
102  Mumbai     200000  Mahindra
103  Nagpur       5000        hi

In [6]:
pd.DataFrame({'cities':['chennnai','mumabai','delhi'],'population':[2000,3000,4000]},index=['A','B','C'])

     cities  population
A  chennnai        2000
B   mumabai        3000
C     delhi        4000

In [7]:
data=pd.DataFrame(np.arange(0,25).reshape(5,5),columns=['COL1','COL2','COL3','COL4','Col5'],index=['a','b','c','d','e'])
data.head()

   COL1  COL2  COL3  COL4  Col5
a     0     1     2     3     4
b     5     6     7     8     9
c    10    11    12    13    14
d    15    16    17    18    19
e    20    21    22    23    24

### Re-Indxing.

In [8]:
import pandas as pd

In [9]:
ser = pd.Series(['India','USA','Germany'],index=[1,5,15])
ser

1       India
5         USA
15    Germany
dtype: object

In [10]:
ser.reindex(np.arange(16))

0         NaN
1       India
2         NaN
3         NaN
4         NaN
5         USA
6         NaN
7         NaN
8         NaN
9         NaN
10        NaN
11        NaN
12        NaN
13        NaN
14        NaN
15    Germany
dtype: object

## Methods to fill(filling method)

#### Foreward filled method:-It is use to fill values from predifine values to next predifine value.

In [12]:
ser.reindex(np.arange(16),method='ffill')

0         NaN
1       India
2       India
3       India
4       India
5         USA
6         USA
7         USA
8         USA
9         USA
10        USA
11        USA
12        USA
13        USA
14        USA
15    Germany
dtype: object

#### Backward filled method:-It is used to fill the null values in back direction from predifined value to next pre-define value.

In [13]:
ser.reindex(np.arange(20),method='bfill')

0       India
1       India
2         USA
3         USA
4         USA
5         USA
6     Germany
7     Germany
8     Germany
9     Germany
10    Germany
11    Germany
12    Germany
13    Germany
14    Germany
15    Germany
16        NaN
17        NaN
18        NaN
19        NaN
dtype: object

#### Nearest method =It is the best method to fill the value value.

In [14]:
ser.reindex(np.arange(20),method='nearest')

0       India
1       India
2       India
3         USA
4         USA
5         USA
6         USA
7         USA
8         USA
9         USA
10    Germany
11    Germany
12    Germany
13    Germany
14    Germany
15    Germany
16    Germany
17    Germany
18    Germany
19    Germany
dtype: object

In [15]:
DATA=pd.DataFrame(np.random.randint(3,50,size=16).reshape(4,4),index=['A','B','D','E'],columns=['C1','C2','C4','C5'])

In [16]:
DATA.reindex(index=['A','B','C','D','E'])

     C1    C2    C4    C5
A  16.0  30.0  44.0  16.0
B   3.0   7.0  39.0  41.0
C   NaN   NaN   NaN   NaN
D   9.0  23.0  38.0   3.0
E   8.0  18.0  22.0  26.0

In [17]:
DATA.reindex(columns=['C1','C2','C3','C4','C5'],index=['A','B','C','D','E'])

     C1    C2  C3    C4    C5
A  16.0  30.0 NaN  44.0  16.0
B   3.0   7.0 NaN  39.0  41.0
C   NaN   NaN NaN   NaN   NaN
D   9.0  23.0 NaN  38.0   3.0
E   8.0  18.0 NaN  22.0  26.0

#### Droping rows and columns.

In [18]:
DATA.drop('B')

   C1  C2  C4  C5
A  16  30  44  16
D   9  23  38   3
E   8  18  22  26

In [19]:
DATA

   C1  C2  C4  C5
A  16  30  44  16
B   3   7  39  41
D   9  23  38   3
E   8  18  22  26

In [20]:
DATA.drop('B',inplace=True) #Inplace is used for change in original posotion.

In [21]:
DATA

   C1  C2  C4  C5
A  16  30  44  16
D   9  23  38   3
E   8  18  22  26

In [22]:
DATA.drop('C2',axis=1) #axis =1 is use for selecting columns and by default it is zero for selecting rows.

   C1  C4  C5
A  16  44  16
D   9  38   3
E   8  22  26

In [23]:
DATA.drop(columns='C2')

   C1  C4  C5
A  16  44  16
D   9  38   3
E   8  22  26

In [24]:
df = pd.DataFrame(np.arange(9).reshape(3,3),columns=['A','B','C'],index=['CSK','MI','KKR'])

In [25]:
df

     A  B  C
CSK  0  1  2
MI   3  4  5
KKR  6  7  8

In [26]:
df['A']

CSK    0
MI     3
KKR    6
Name: A, dtype: int32

In [27]:
df[['A','B']]

     A  B
CSK  0  1
MI   3  4
KKR  6  7

In [28]:
df[{'A','B'}]

     A  B
CSK  0  1
MI   3  4
KKR  6  7

In [29]:
df[1:3] #using slicing.

     A  B  C
MI   3  4  5
KKR  6  7  8

In [30]:
df>4

         A      B      C
CSK  False  False  False
MI   False  False   True
KKR   True   True   True

In [31]:
df[df>4] #for displayig the values.

       A    B    C
CSK  NaN  NaN  NaN
MI   NaN  NaN  5.0
KKR  6.0  7.0  8.0

In [32]:
df[df['A']>4] #for checkind condition for particular columns A.

     A  B  C
KKR  6  7  8

In [33]:
df[df['A']>2]

     A  B  C
MI   3  4  5
KKR  6  7  8

In [34]:
data=pd.Series(index=['a','b','c','d','e','f'],data=[1,2,3,4,5,6])

In [35]:
data

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [36]:
data[1:4:2]

b    2
d    4
dtype: int64

In [37]:
data[data<4]

a    1
b    2
c    3
dtype: int64

In [38]:
data['a']

1

In [39]:
data>3

a    False
b    False
c    False
d     True
e     True
f     True
dtype: bool

### Sorting,Series and DataFrame.

In [40]:
import pandas as pd
import numpy as np

In [41]:
from pandas import Series,DataFrame

In [42]:
name =Series(np.random.randint(1,40,size=11),index=['A','B','C','D','C','E','F','G','H','I','J'])

In [43]:
name

A     1
B    33
C    38
D     4
C    13
E    39
F     6
G     9
H    17
I     7
J    33
dtype: int32

In [48]:
name =Series(np.random.randint(1,40,size=11),index=['A','B','C','D','C','E','F','G','H','I','J'])

In [49]:
name

A     7
B     8
C    31
D    38
C    25
E    15
F    29
G    20
H    13
I     9
J    22
dtype: int32

In [50]:
#sorting always by default in asendinding order.

In [51]:
var1 = name.sort_values()
print(var1)

A     7
B     8
I     9
H    13
E    15
G    20
J    22
C    25
F    29
C    31
D    38
dtype: int32

In [52]:
var2=name.sort_values(ascending=False)
var1

A     7
B     8
I     9
H    13
E    15
G    20
J    22
C    25
F    29
C    31
D    38
dtype: int32

In [53]:
var1.sort_index() #to sort the index values inside the series.

A     7
B     8
C    25
C    31
D    38
E    15
F    29
G    20
H    13
I     9
J    22
dtype: int32

In [54]:
df=DataFrame(np.random.randint(1,100,30).reshape(10,3),columns=['english','hindi','science'],index=list('abcdefghij'))

In [55]:
df

   english  hindi  science
a       37     78       46
b        1     21        1
c        7     49       31
d       14     15       13
e       91     44       49
f       59     85       62
g       16     88       46
h       95     32       86
i       32     37       11
j       39     76        5

In [56]:
df['hindi'].sort_values()

d    15
b    21
h    32
i    37
e    44
c    49
j    76
a    78
f    85
g    88
Name: hindi, dtype: int32

In [57]:
df['hindi'].sort_values(ascending=False)

g    88
f    85
a    78
j    76
c    49
e    44
i    37
h    32
b    21
d    15
Name: hindi, dtype: int32

In [58]:
x=df.sort_values(by=['hindi','english'],ascending=False) #it will effect on only first preference.whater it maay be ascending or decending.
x

   english  hindi  science
g       16     88       46
f       59     85       62
a       37     78       46
j       39     76        5
c        7     49       31
e       91     44       49
i       32     37       11
h       95     32       86
b        1     21        1
d       14     15       13

In [59]:
df[df<40] #square bracket given null

   english  hindi  science
a     37.0    NaN      NaN
b      1.0   21.0      1.0
c      7.0    NaN     31.0
d     14.0   15.0     13.0
e      NaN    NaN      NaN
f      NaN    NaN      NaN
g     16.0    NaN      NaN
h      NaN   32.0      NaN
i     32.0   37.0     11.0
j     39.0    NaN      5.0

#### Rank

In [60]:
SE = Series(np.random.randint(1,50,size=10),index=list('ABCDEFGHIJ'))

In [61]:
SE

A     8
B    37
C    14
D    33
E     4
F    29
G    11
H    35
I    31
J     1
dtype: int32

In [62]:
SE.rank()#lowest is fisrt and highest is last.
#If the value is repeated then it takes the mid value of two ranks and take it as rank for two variable.
#rank of same()+rank of same()/2

A     3.0
B    10.0
C     5.0
D     8.0
E     2.0
F     6.0
G     4.0
H     9.0
I     7.0
J     1.0
dtype: float64

In [63]:
SE.rank(method='min') #when we use the method min we take lower rank and then skip the upper rank.
#3.5-3
#drop 4

A     3.0
B    10.0
C     5.0
D     8.0
E     2.0
F     6.0
G     4.0
H     9.0
I     7.0
J     1.0
dtype: float64

In [64]:
SE.rank(method='max') #vice versa the min method
#3.5-4
#drop 3

A     3.0
B    10.0
C     5.0
D     8.0
E     2.0
F     6.0
G     4.0
H     9.0
I     7.0
J     1.0
dtype: float64

In [65]:
#dense method-no drop #it is perfect method for rank it doesn't delate anything.
SE.rank(method='dense')

A     3.0
B    10.0
C     5.0
D     8.0
E     2.0
F     6.0
G     4.0
H     9.0
I     7.0
J     1.0
dtype: float64

In [66]:
x['percentage']=(x['english']+x['hindi']+x['science']/300)*100

In [67]:
x

   english  hindi  science    percentage
g       16     88       46  10415.333333
f       59     85       62  14420.666667
a       37     78       46  11515.333333
j       39     76        5  11501.666667
c        7     49       31   5610.333333
e       91     44       49  13516.333333
i       32     37       11   6903.666667
h       95     32       86  12728.666667
b        1     21        1   2200.333333
d       14     15       13   2904.333333

In [68]:
x['rank']=x['percentage'].rank(method='dense')

In [69]:
x

   english  hindi  science    percentage  rank
g       16     88       46  10415.333333   5.0
f       59     85       62  14420.666667  10.0
a       37     78       46  11515.333333   7.0
j       39     76        5  11501.666667   6.0
c        7     49       31   5610.333333   3.0
e       91     44       49  13516.333333   9.0
i       32     37       11   6903.666667   4.0
h       95     32       86  12728.666667   8.0
b        1     21        1   2200.333333   1.0
d       14     15       13   2904.333333   2.0

In [70]:
series=Series(data=['one','two','three',np.nan])
series

0      one
1      two
2    three
3      NaN
dtype: object

In [71]:
series.isnull()

0    False
1    False
2    False
3     True
dtype: bool

In [72]:
series.isnull().sum()

1

In [73]:
series.notnull().sum()

3

In [74]:
series.dropna()  #to drop the null values.

0      one
1      two
2    three
dtype: object

In [75]:
dataframe = pd.DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [76]:
dataframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [77]:
dataframe.dropna()

     0    1    2
0  1.0  2.0  3.0

In [78]:
dataframe.dropna(axis=1)  #for column axis =1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [79]:
dataframe.dropna(how='all') #for all is used to drop the row which conatins all null values.

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [80]:
dataframe.dropna(thresh=1)  #thresh value 1 means check atleast one value is not null.

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [81]:
dataframe.dropna(thresh=2)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [82]:
dataframe.dropna(thresh=3,axis=1)

     2
0  3.0
1  6.0
2  9.0
3  NaN

In [83]:
dataframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

#### Fill Dataframe.

In [84]:
dataframe.fillna(5)

     0    1    2
0  1.0  2.0  3.0
1  5.0  5.0  6.0
2  7.0  5.0  9.0
3  5.0  5.0  5.0

In [85]:
dataframe[0] = dataframe.fillna(5)

In [86]:
dataframe

     0    1    2
0  1.0  2.0  3.0
1  5.0  5.0  6.0
2  7.0  NaN  9.0
3  5.0  NaN  NaN

In [87]:
dataframe[0] = dataframe.fillna(5,inplace=True)

In [88]:
dataframe

      0    1    2
0  None  2.0  3.0
1  None  5.0  6.0
2  None  5.0  9.0
3  None  5.0  5.0

In [89]:
x['Index']=[0,1,2,3,4,5,6,7,8,9] #this isn how we can make the column.

In [90]:
x

   english  hindi  science    percentage  rank  Index
g       16     88       46  10415.333333   5.0      0
f       59     85       62  14420.666667  10.0      1
a       37     78       46  11515.333333   7.0      2
j       39     76        5  11501.666667   6.0      3
c        7     49       31   5610.333333   3.0      4
e       91     44       49  13516.333333   9.0      5
i       32     37       11   6903.666667   4.0      6
h       95     32       86  12728.666667   8.0      7
b        1     21        1   2200.333333   1.0      8
d       14     15       13   2904.333333   2.0      9

#### Rename indexing series and dataframe.

Syntax variable_name.rename({dictionary old :new})

In [91]:
import pandas as pd
name=pd.Series([1,2,3,4,5,6,7],index = list('ABCDEFG'))
name

A    1
B    2
C    3
D    4
E    5
F    6
G    7
dtype: int64

In [92]:
name.rename({'A':'Alpha','B':'Beeta'},inplace=True)

In [93]:
print(name)

Alpha    1
Beeta    2
C        3
D        4
E        5
F        6
G        7
dtype: int64

In [94]:
import numpy as np

In [95]:
data=pd.DataFrame(np.arange(0,9).reshape(3,3),columns=['NY','LA','SP'],index=['A','B','C'])
data

   NY  LA  SP
A   0   1   2
B   3   4   5
C   6   7   8